// Для проверки работоспособности ставим на компьютер виртуальный телефон - XCode или Android Studio (аналоги ios или android).
// На мобильном телефоне ставим Expo - позволит подключаться по QR-коду к проекту на компьютере(если находятся в одной локальной сети), qr код выдается в терминале при запуске приложения

// npx create-expo-app -t expo-template-blank-typescript  - устанавливаем expo(библиотека для работы с react native) на компьютер

// npm start  - запуск приложения, выдаст в терминале qr-код для подключения мобильного устройства и инструкции для подключения виртуальных телефонов(предварительно их нужно запустить)